Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Конечные классы: В таблице конечных классов нижняя граница класса отличалась от верхней границы предыдущего класса.
en: Coarse classes: The lower class cound differed from the upper bound of the previous class in the coarse classes table.

source: Конечные классы: Исправлена ошибка Access violation at address.
en: Coarse classes: Access violation at address error was corrected.

source: Конечные классы: в режиме редактирования разбиения всегда были активны кнопки «Объединить с предыдущим» и «Объединить со следующим».
en: Coarse сlasses: "Merge with previous" and "Merge with next" buttons were always active in the binning editing mode.

source: Конечные классы: отключено отображение с округлением значений границ конечного класса в мастере настройки.
en: Coarse сlasses: view with rounding of values of the coarse class bounds is disabled in the wizard.

source: Конечные классы: при объединении классов с непрерывным типом данных некорректно определялись верхние и нижние границы обновленных классов (#8577).
en: Coarse сlasses: while merging classes with continuous data type, the upper and lower bounds of the updated classes were incorrectly defined (#8577).

source: Конечные классы: ранее не учитывалась локаль при сравнении значений событий, в результате чего могли возникать проблемы в редких и очень специфичных случаях.
en: Coarse сlasses: Previously, locale was not taken into account when comparing event values that could cause serious problems in rare and very specific cases.

source: Куб, Подмодель: если внутри базовой Подмодели у одного из узлов был настроен визуализатор Куб с настроенной сортировкой по одному из столбцов, то при попытке настроить производную Подмодель возникала ошибка "Атрибут __baseName не существует" (#8536).
en: Cube, Supernode: if the Cube visualizer with the sorting configured by one of the columns was configured in the base Supernode, while attempting to configure the derived Supernode, the following error occurred: "__baseName attribute does not exist" (#8536).

source: Куб, Подмодель: если внутри производной Подмодели у узла, содержащего настроенный визуализатор Куб настроить сортировку, а затем у узла базовой Подмодели добавить измерения в Кубе, то после обновления конфигурации узла настроенный визуализатор помечался ошибочным (#8528).
en: Cube, Supernode: if sorting was configured for the node containing the configured Cube visualizer in the derived Supernode, and then dimensions in the Cube were added for the base Supernode node, the configured visualizer was marked as the invalid one upon the node configuration update (#8528).

source: Куб: при работе в Microsoft Edge с версией ниже 79 во время экспорта из визуализаторов возникала ошибка «Не удалось экспортировать кросс-таблицу Куба: Function expected» (#8255).
en: Cube: the following error occurred in Microsoft Edge to 79 during export from visualizers: «Failed to export the Cube crosstab: Function expected» (#8255).

source: Куб: если количество измерений в колонках было больше, чем количество колонок в кросс-таблице, то при экспорте часть меток измерений не отображалась.
en: Cube: if the number of dimensions in columns was higher than the number of columns in the cross table, some part of dimension captions was not displayed when exporting.

source: Куб: если многократно быстро нажималась кнопка «Детализация», то панель детализации могла начать беспрерывно разворачиваться и сворачиваться, даже после прекращения нажатий (#8842).
en: Cube: if "Detailing" button was quickly pressed many times, the detailing bar could start to expand and collapse continuously even without pressing (#8842).

source: Куб: после изменения размеров вкладок полей и диаграммы Куба в течение одной секунды кнопки на Панели инструментов Куба не реагировали на нажатие (#8831).
en: Cube: when sizes of fields tabs and Cube chart were changed, the Cube Toolbar buttons did not respond to pressure for a second (#8831).

source: Куб: при открытии окна настройки ограничений иногда могли не отобразиться значения параметров по умолчанию (#8827).
en: Cube: when opening the restriction wizard window, sometimes the default parameters values were not displayed (#8827).

source: Куб: при сохранении пакета не сохранялся порядок полей, перенесенных в область фильтрации Куба (#8490).
en: Cube: while package saving, order of the fields transferred to the Cube filtering area was not saved (#8490).

source: Логирование: Для частей лога, которые записаны в формате JSON (параметры), добавлено экранирование значений строковых параметров, параметры типа Boolean вместо True и False теперь записываются как true и false.
en: Logging: Screening of the string parameters values was added for the log parts that are recorded in JSON format (parameters). Now the parameters related to the Boolean type instead of True and False are recorded as trueand false.

source: Логирование: При блокировании/разблокировании сессии пользователя через главное меню, в лог будет записано соответствующее сообщение.
en: Logging: When locking/unlocking the user session via the main menu, corresponding message will be recorded in the log.

source: Логирование: Появилась возможность логирования больших сообщений из узла JavaScript при логировании в journald.
en: Logging: Logging of large messages from JavaScript when logging to journald became possible.

source: Логирование: в log-файл не писалось имя пользователя при использовании большого количества параллельных потоков, которые не нагружают процессор, в «Цикле».
en: Logging: It was not possible to write the user name in the log file when using many parallel threads that do not load the processor in "Loop".

source: Логирование: в сообщения лога для событий начала и окончания выполнения узла добавлен GUID (уникальный идентификатор) узла (#8667).
en: Logging: node GUID (unique identifier) was added to the log messages for the events relating to the node execution start and end (#8667).

source: Локализация: если англоязычная версия программы была запущенна на русской версии Windows, то при вводе вещественных чисел в качестве разделителя необходимо было указывать точку <.>, при этом редактор подсвечивал такой разделитель, как ошибочный (#8141).
en: Localization: if the English program version was started with the Russian Windows version, when entering real numbers as separators, it was required to put a point <.>, in this case, the editor highlighted such separator as the invalid one (#8141).

source: Маппинг полей: в некоторых случаях в мастере Маппинга полей связь между входным и выходным полем не совпадала с центром записи.
en: Fields mapping: in some cases in Fields mapping wizard connection of the input and output fields did not map the record center.

source: Настольное приложение: При открытии какого-либо пакета (открыть с помощью Loginom) или просто при запуске Loginom CE, окно приложения открывалось, но интерфейс не отображался.
en: Desktop application: When opening any package (to open using Loginom) or just when starting Loginom CE, the application window was opened but the interface was not displayed.

source: Настольное приложение: Решили проблемы некорректного отображения окна приложения при использовании настольных редакций Loginom с двумя мониторами:
en: Desktop application: The following problems were solved: incorrect display of the application window when the desktop Loginom edition with two display monitors was used, namely:

source: Настольное приложение: если использовалось несколько мониторов и окно приложения переносилось на дополнительный экран, то при разворачивании на весь экран окно приложения сворачивалось и было невозможно его восстановить.
en: Desktop application: if several screens were used, and the application window was moved to the additional screen, when expanding to full screen, the application window was collapsed and it was not possible to restore it.

source: Настройка соответствия между столбцами: если у узла с ранее настроенными входными полями отключали автоматическую синхронизацию полей и подключали на вход узел, содержащий другой набор полей, то некорректно работали вызовы «Удаление всех связей» и «Очистить/удалить потерянные связи».
en: Adjustment of Columns Mapping: if automapping of fields was disabled for the node with preset input fields, and the node that contained another set of fields was connected to the input, "Delete all links" and "Clear/delete lost links" calls functioned incorrectly.

source: Настройка соответствия между столбцами: при настройке выходных портов узла Замена не отображались названия входных полей, при выделении строки названия полей отображались.
en: Adjustment of Columns Mapping: while configuring the output ports of the Replacement node, the input fields names were not shown, when selecting the string, the fields names were shown.

source: Настройка соответствия полей: если по нажатию на кнопку «Назад» вернуться на страницу мастера настройки, которая ранее была пропущена нажатием на кнопку «Все равно далее», то по-прежнему отображалась кнопка «Все равно далее», хотя должна была измениться (#8781).
en: Fields mapping settings: if "Back" button was pressed to return to the wizard page that was earlier missed by pressing on "Next anyway" button, "Next anyway" button was still displayed although it was to be changed (#8781).

source: Область построения сценария: В сильно загруженной системе при перетаскивании компонента в область построения сценария он откреплялся от курсора и добавлялся в область построения сценария сразу после того, как появлялся над этой областью.
en: Workflow construction area: When dragging the component to the workflow construction area in the heavily loaded system, it was unfixed from the cursor and added to the workflow construction area just after it appeared over this area.

source: Область построения сценария: Если изменить масштаб при помощи функции «Карта сценария», добавить в область построения сценария узел в правый нижний угол, затем сохранить и закрыть пакет, то после открытия пакета в масштабе 100% координаты добавленного узла были неверными.
en: Workflow construction area: If the scale was changed using the "Workflow map" function, the node was added to the workflow construction area in the right lower corner, then the package was saved and closed, and the coordinates of the added node were incorrect after saving the package in 100% scale.

source: Область построения сценария: Если клонировать узел со скрытым комментарием, а потом сразу сохранить сценарий или свернуть клонированный узел в Подмодель, то статусы видимости и свернутости у комментария клонированного узла были перепутаны, и у клонированного узла был виден скрытый комментарий.
en: Workflow construction area: If the node was cloned with the hidden comment and then the workflow was saved or the cloned node was collapsed to the Supernode, the visibility and collapse statuses of the cloned node comment were confused, and the hidden comment of the cloned node was visible.

source: Область построения сценария: Если попытаться переименовать заблокированный узел, то после сообщения об ошибке «Узел заблокирован», изменить метку нельзя, скрывалась иконка замка у метки узла.
en: Workflow construction area: While attempting to rename the locked node, it was not possible to change the caption after "Node is locked" error message, and the lock icon was hidden at the node caption.

source: Область построения сценария: Клонированный узел появлялся далеко от исходного, если исходный располагался далеко от левого верхнего угла области построения сценария.
en: Workflow construction area: The cloned node appeared far from the source one if the source node was located far from the left upper corner of the workflow construction area.

source: Область построения сценария: После отмены через Панель процессов длительно выполняющегося процесса (например, узла JavaScript с циклом на 100000000 итераций) продолжала выполняться анимация активации узла в области построения сценария, некоторые элементы интерфейса были недоступны.
en: Workflow construction area: After cancellation of the process executed for a long time via Processes Bar (for example, JavaScript node with the loop equal to 100,000,000 iterations), the node activation animation was preserved in the workflow construction area, some interface elements were not available.

source: Область построения сценария: После помещения узла в область построения сценария не завершался процесс его перетаскивания, в результате чего на экране наблюдались различные визуальные дефекты (подсказки, анимация, не полное прорисовывание иконок узлов).
en: Workflow construction area: After dragging the node to the workflow construction area, the process of its dragging was not finished. That is why different visual defects were observed on the screen (tips, animation, incomplete drawing of node icons).

source: Область построения сценария: На выходе Подмодели пропадала иконка служебного порта после сохранения и повторного открытия пакета и удаления одной из нескольких связей, подключенных к этому порту.
en: Workflow construction area: At the Supernode output the service port icon disappeared after package was saved and repeatedly opened and when one of several links connected to this port was deleted.

source: Обращаем внимание: для версии Loginom 7.0 необходимы новые лицензионные SP-ключи или обновление прошивки USB-ключа.
en: Please note: new license SP dongles or update of USB key weaving are required for Loginom 7.0 version.

source: Отображение ошибок: во всплывающем окне с ошибкой обрезались длинные имена файлов, если они не помещались по ширине.
en: Errors display: The long file names were cut with an error in the pop-up window if there was no enough space for them across the width.

source: Панель Навигация: если у узла был настроен визуализатор, то в панели Навигация у этого узла появлялся дочерний элемент Визуализаторы.
en: Navigation Bar: if visualizer was configured for the node, Visualizers child element appeared for such node on the Navigation bar.

source: Панель Навигация: при вызове пункта контекстного меню «Настроить узел» открывается мастер настройки для выбранного узла (ранее узел выделялся и становился активным в поле Сценария).
en: Navigation Bar: when calling "Configure node" context menu item, the wizard for the selected node is opened (previously, the node was selected and became active in the Workflow field).

source: Панель компонентов: иногда возникала путаница в панели «Подключений» с отображением «открытых» узлов из подключенного по ссылке пакета.
en: Component bar: Sometimes there was confusion related to the "Connection" bar with the displayed "public" nodes from the package connected by reference.

source: Панель отчетов: если визуализатор был открыт в виде Отчета, то при открытии на соседней вкладке этого же визуализатора из узла, вкладка с Отчетом не закрывалась автоматически и можно было изменять настройки визуализатора в двух вкладках одновременно, что могло приводить к ошибкам (#8089).
en: Reports bar: if the visualizer was opened in the Report form, when opening in the next tab of the same visualizer from the node, the Report tab was not closed automatically, and it was possible to change the visualizer settings in two tabs simultaneously that could cause errors (#8089).

source: Подключение ODBC: При подключении к Excel через ODBC не отображался список листов в дереве «Таблица/Представление».
en: ODBC connection: When connecting to Excel via ODBC, the list of sheets in the "Table/View" tree was not displayed.

source: Подключение Oracle: Исправлена ошибка "Can bind a LONG value only for insert a LONG column", которая возникала при экспорте в базу данных Oracle в Direct mode для длинных строк при включенном расширении типов (#9147).
en: Oracle connection: "Can bind a LONG value only for insert a LONG column" error was corrected. It occurred during export to Oracle database in Direct mode for the long strings with enabled extension of types (#9147).

source: Подключение Oracle: Исправлена ошибка "ORA-03113: end-of-file on communication channel", которая возникала, если повторно выполнить импорт данных после разрыва соединения с сервером.
en: Oracle connection: "ORA-03113: end-of-file on communication channel" error was corrected. It occurred if data was repeatedly imported after disconnection with the server.

source: Подключение SOAP-сервис: Исправлена ошибка Access violation at address при подключении к SOAP-сервису, если схема содержит ComplexType с mixed содержимым (#9864).
en: SOAP service connection: Access violation at address error was corrected. It occurred when connectin to SOAP service if the schema contained ComplexType with mixed content (#9864).

source: Подключение к SOAP-сервисам: в версии 6.4.0 при настройке на этапе проверки подключения возникала ошибка «Файл “…?wsdl” не найден» (#8216).
en: Connection to SOAP services: the following error occurred in version 6.4.0 during the setting at the connection check stage: “…?wsdl” file not found" (#8216).

source: Подключение к базам данных: скорректирована CSS верстка.
en: Connection to Databases: CSS layout was corrected.

source: Подключение к базе данных: При разорванном соединении базы данных с сервером запуск на выполнение узла Импорт из базы данных завершался отменой выполнения узла, т.е. узел не выполнялся, а пользователь не получал никаких сообщений.
en: Connection to database: When database and server connection was lost, start of Import from database node execution was finished with cancellation of the node execution. Namely, the node was not executed, and the user received no messages.

source: Подмодель: если был активирован узел, подключенный к выходному порту Подмодели, а сама Подмодель не была активирована, а после после этого пакет, содержащий Подмодель, был сохранен и закрыт, то при повторном открытии пакета и попытки активировать Подмодель, возникала ошибка «Порт не настроен» (#8538).
en: Supernode: if the node connected to the output Supernode port was activated, and the Supernode itself was not activated, and then the package containing the Supernode was saved and closed, on repeated package opening and while attempting to activate the Supernode, the following error occurred: "Port not configured" (#8538).

source: Подмодель: если по узлу, содержащемуся внутри Подмодели был создан Производный компонент, а затем по такой Подмодели создавался Производный узел, в котором удалялся содержащийся внутри узел, то при попытке клонировать такую Подмодель возникала ошибка «Базовый узел не найден» (#8798).
en: Supernode: if the Derived Component was created by the node that was included into the Supernode and then the Derived Node with the deleted included node was created by this Supernode, the following error occurred while attempting to clone such Supernode: "Base node not found" (#8798).

source: Подмодель: если после создания производного компонента и создания производного узла, изменялась базовая Подмодель (например, внутрь подмодели был добавлен еще один узел), то при попытке активировать производный узел возникала ошибка «Внутренние узлы Подмодели заблокированы».
en: Supernode: if the base Supernode was changed upon creation of the derived component and derived node (for example, one more node was added to the supernode), while attempting to activate the derived node, the following error occurred: "Internal Supernode nodes locked".

source: Подмодель: исправлена ошибка "Компонент неисправен" при создании производного узла, если базовый узел изменён и заблокирован.
en: Supernode: The following error was corrected: "Component is malfunctioned". It occurred when creating the derived node if the base node was changed and locked.

source: Подмодель: отключено отложенное обновление конфигурации производного компонента, если он нигде не используется.
en: Supernode: delayed configuration update of the derived component was disabled if it was used nowhere else.

source: Приложение: В визуализаторе Таблица, в Инспекторе свойств и в Диспетчере можно было столкнуться с ситуацией, когда при клике правой кнопкой мыши в таблице не выделялась ячейка, а контекстное меню отображало пункты для предыдущей выделенной ячейки.
en: Application: The following situation was observed in Table, Property inspector and Session manager visualizers: the cell was not selected in the table after right-clicking, and the context menu displayed the items for the previous selected cell.

source: Приложение: В мастерах настройки не скрывалась всплывающая подсказка для связи, у которой отсутствует поле.
en: Application: The pop-up tip was not hidden in the wizards for the link for which there was no field.

source: Приложение: В редакторе ввода значений типа Дата/время (используется, например, в узле Фильтр строк) не локализовался первый день недели и текст кнопки установки текущей даты (в русскоязычной и англоязычной версиях кнопка называлась Current Date).
en: Application: The first week day and the text of the Current Date button (the button name is Current Date in the Russian and English versions) were not localized in the Date/time value entry editor (for example, it is used in Row filter node).

source: Приложение: Исправлена ошибка "Cannot read property 'NodeIndex' of null", которая возникала, если пользователь с правами только на администрирование открывал пакет из файлового хранилища.
en: Application: "Cannot read property 'NodeIndex' of null" error was corrected. It occurred if the user with the administration rights only opened the package from the file storage.

source: Приложение: Оптимизировано сравнение значений переменного типа, внутри которых были строки, в результате чего в некоторых сценариях узлы Фильтр строк стали активироваться быстрее на 25%.
en: Application: Comparison of the variable values with the rows inside was optimised. As a result, Row filter nodes in some workflows are activated 25% faster.

source: Приложение: В мастерах настройки исправлена ошибка "Cannot read properties of null (reading 'setValue')", которая возникала при перемещении с помощью клавиш навигации в панели переключения страниц (#9399).
en: Application: The following error was corrected in the wizards: "Cannot read properties of null (reading 'setValue')". It occurred while moving using the navigation keys on the page switch panel (#9399).

source: Приложение: В сценариях Loginom подготовленных на Windows 7 и Windows Server 2008 R2, при переносе на более новые версии операционной системы, могли возникать ошибки из-за различий в сортировке строк, содержащих буквы Й, И.
en: Application: In the Loginom workflows prepared in Windows 7 and Windows Server 2008 R2, when transferring to newer versions of operational system, errors connected with differences in sorting of the strings that contained Й, И letters could occur.

source: Приложение: Исключили сообщение об ошибке "Строка "__deleted" не может быть преобразована в значение логического типа".
en: Application: "Row "__deleted" cannot be transformed to the logical value" error message was deleted.

source: Приложение: Сообщение об отсутствии компонента в текущей редакции Loginom сделано более информативным (например, SOAP-запрос недоступен в редакциях Loginom CE и Loginom Team).
en: Application: Message on absence of the component in the current Loginom edition became more informative (for example, SOAP request is not available in Loginom CE and Loginom Team editions).

source: Производительность: Выполнение в Цикле Подмодели с большим количеством производных узлов стало быстрее на 30%.
en: Performance: Execution in the Loop of the Supernode with many derived nodes became 30% faster.
